**Module 4 Project  Habtom Woldu**

Author: **Habtom1999** Repository: **datafun-04-notbooks**

## Task 1. Create DataFrame

In [40]:
import pandas as pd

In [41]:
grades_dict = {'Wally': [87, 96, 70], 'Eva': [100, 87, 90],
               'Sam': [94, 77, 90], 'Katie': [100, 81, 82],
               'Bob': [83, 65, 85], 'Habtom': [89,76,83]}

In [42]:
grades = pd.DataFrame(grades_dict)

In [43]:
grades

   Wally  Eva  Sam  Katie  Bob  Habtom
0     87  100   94    100   83      89
1     96   87   77     81   65      76
2     70   90   90     82   85      83

## Task 2. Custom Index

# Follow the instructions to apply a custom index (instead of 0,1,2), let's call them 'Test1', Test2', and 'Test3'.

In [44]:
pd.DataFrame(grades_dict, index = ['Test1','Test2', 'Test3'])

       Wally  Eva  Sam  Katie  Bob  Habtom
Test1     87  100   94    100   83      89
Test2     96   87   77     81   65      76
Test3     70   90   90     82   85      83

In [45]:
grades.index = ['Test1', 'Test2', 'Test3']

In [46]:
grades

       Wally  Eva  Sam  Katie  Bob  Habtom
Test1     87  100   94    100   83      89
Test2     96   87   77     81   65      76
Test3     70   90   90     82   85      83

# Find Eva's grades with grades['Eva']

In [47]:
grades['Eva']

Test1    100
Test2     87
Test3     90
Name: Eva, dtype: int64

# Find Sam's grades with grades

In [48]:
grades.Sam

Test1    94
Test2    77
Test3    90
Name: Sam, dtype: int64

## Task 3. Accessing Rows (loc, iloc)

# using loc['Test1'] to get scores for the first exam

In [49]:
grades.loc['Test1']

Wally      87
Eva       100
Sam        94
Katie     100
Bob        83
Habtom     89
Name: Test1, dtype: int64

# Use iLoc[0] to get scores for the first exam

In [50]:
grades.iloc[0]

Wally      87
Eva       100
Sam        94
Katie     100
Bob        83
Habtom     89
Name: Test1, dtype: int64

# Use iLoc[1] to get scores for the second exam

In [51]:
grades.iloc[1]

Wally     96
Eva       87
Sam       77
Katie     81
Bob       65
Habtom    76
Name: Test2, dtype: int64

# Which do you prefer?

Answer.  I think grades.loc['Test1'] approach is good for me beacuse I can see the first name (string) rather than the integer o

# We can also get slices of rows, e.g., from ['Test1':'Test3'], inclusive, or, using index values, from [0:2], inclusive.

In [52]:
grades.loc ['Test1': 'Test3']

       Wally  Eva  Sam  Katie  Bob  Habtom
Test1     87  100   94    100   83      89
Test2     96   87   77     81   65      76
Test3     70   90   90     82   85      83

## Task 3. Accessing Subsets (at, iat)

Q. Use grades.at['Test2', 'Eva'} to find her score on the second exam using labels.

In [53]:
grades.at['Test2', 'Eva']

87

Q. Use grades.iat[2,0] to get the score on the third exam for the first student (Wally), using indices.

In [54]:
grades.iat[2,0]

70

## Task 4. Describe (By Column)

Q. Use grades.describe() to get descriptive statistics for our gradebook columns.

In [55]:
grades.describe()

       Wally     Eva    Sam   Katie    Bob  Habtom
count   3.00    3.00   3.00    3.00   3.00    3.00
mean   84.33   92.33  87.00   87.67  77.67   82.67
std    13.20    6.81   8.89   10.69  11.02    6.51
min    70.00   87.00  77.00   81.00  65.00   76.00
25%    78.50   88.50  83.50   81.50  74.00   79.50
50%    87.00   90.00  90.00   82.00  83.00   83.00
75%    91.50   95.00  92.00   91.00  84.00   86.00
max    96.00  100.00  94.00  100.00  85.00   89.00

Q.  why learning Python and DataFrames can be so powerful? Python and DataFrames are so poweful you can perfrom a descriptive statistics by single code.

In [56]:
pd.set_option(' precision', 2)

OptionError: No such keys(s): ' precision'

In [ ]:
grades.describe()

           Wally         Eva        Sam       Katie        Bob     Habtom
count   3.000000    3.000000   3.000000    3.000000   3.000000   3.000000
mean   84.333333   92.333333  87.000000   87.666667  77.666667  82.666667
std    13.203535    6.806859   8.888194   10.692677  11.015141   6.506407
min    70.000000   87.000000  77.000000   81.000000  65.000000  76.000000
25%    78.500000   88.500000  83.500000   81.500000  74.000000  79.500000
50%    87.000000   90.000000  90.000000   82.000000  83.000000  83.000000
75%    91.500000   95.000000  92.000000   91.000000  84.000000  86.000000
max    96.000000  100.000000  94.000000  100.000000  85.000000  89.000000

Q. Does it work? Libraries are evolving.

It does not work and bring the above error message and I try to find a solution. upgrading the version of pandas and I did , but it doesnt work

 try pd.set_option("display.precision",2).

In [ ]:
pd.set_option("display.precision",2)

In [ ]:
grades.describe()

       Wally     Eva    Sam   Katie    Bob  Habtom
count   3.00    3.00   3.00    3.00   3.00    3.00
mean   84.33   92.33  87.00   87.67  77.67   82.67
std    13.20    6.81   8.89   10.69  11.02    6.51
min    70.00   87.00  77.00   81.00  65.00   76.00
25%    78.50   88.50  83.50   81.50  74.00   79.50
50%    87.00   90.00  90.00   82.00  83.00   83.00
75%    91.50   95.00  92.00   91.00  84.00   86.00
max    96.00  100.00  94.00  100.00  85.00   89.00

pd.set_option("display.precision",2) code work perfect and pd.set_option("display.precision") and pd.set_option(' precision') are the same thing.

## Task 5. Transpose (rows <--> columns)

Q. average for each column by calling grades.mean()

In [ ]:
grades.mean()

Wally     84.33
Eva       92.33
Sam       87.00
Katie     87.67
Bob       77.67
Habtom    82.67
dtype: float64

Q. Transpose the DataFrame using the T attribute.

In [ ]:
grades.T

        Test1  Test2  Test3
Wally      87     96     70
Eva       100     87     90
Sam        94     77     90
Katie     100     81     82
Bob        83     65     85
Habtom     89     76     83

Q.  Get the mean by the new columns with .T.describe()

In [ ]:
grades.T.describe()

        Test1  Test2  Test3
count    6.00   6.00   6.00
mean    92.17  80.33  83.33
std      7.03  10.54   7.37
min     83.00  65.00  70.00
25%     87.50  76.25  82.25
50%     91.50  79.00  84.00
75%     98.50  85.50  88.75
max    100.00  96.00  90.00

## Task 6. Sort

Q.  Sort the gradebook rows in reverse order so the most recent exam row appears at the top

In [ ]:
grades.sort_index(ascending=False)

       Wally  Eva  Sam  Katie  Bob  Habtom
Test3     70   90   90     82   85      83
Test2     96   87   77     81   65      76
Test1     87  100   94    100   83      89

Q. Sort the gradebook columns so the names appear in order

In [ ]:
grades.sort_index(axis=1)

       Bob  Eva  Habtom  Katie  Sam  Wally
Test1   83  100      89    100   94     87
Test2   65   87      76     81   77     96
Test3   85   90      83     82   90     70